app/views/predictions/show.html.erb


<% unless @prediction.wagers.empty? %>
---
SELECT  1 AS one FROM "wagers"  WHERE "wagers"."prediction_id" = $1 LIMIT 1  [["prediction_id", 40]]
SELECT "wagers".* FROM "wagers"  WHERE "wagers"."prediction_id" = $1  [["prediction_id", 13]]