app/views/users/show.html.erb


<% if @user.predictions.length < 1 %>
---
SELECT "predictions".* FROM "predictions"  WHERE "predictions"."user_id" = $1  [["user_id", 37]]


<% if @user.wagers.length < 1 %>
---
SELECT "wagers".* FROM "wagers"  WHERE "wagers"."user_id" = $1  [["user_id", 8]]


<% if @user.judgments.length < 1 %>
---
SELECT "judgments".* FROM "judgments"  WHERE "judgments"."user_id" = $1  [["user_id", 42]]