app/controllers/predictions_controller.rb

SELECT "predictions".* FROM "predictions"
---
  def index
    @predictions = Prediction.all

SELECT COUNT(*) FROM "predictions"  WHERE (judged = 'f')
SELECT "predictions".* FROM "predictions"  WHERE (judged = 'f')
---
  def undetermined
    @prediction_count = Prediction.count
    @predictions = Prediction.where("judged = ?", false).sort_by do |prediction|

INSERT INTO "predictions" ("created_at", "deadline", "judged", "statement", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    parsed_datetime = Prediction.parse_datetime(params[:prediction][:deadline])
    @prediction = Prediction.new
    @prediction.statement = params[:prediction][:statement]
    @prediction.deadline = parsed_datetime
    @prediction.user_id = current_user.id

    if @prediction.save

SELECT  "predictions".* FROM "predictions"  WHERE "predictions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @prediction = Prediction.find(params[:id])