app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "session_token", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = 8 LIMIT 1
SELECT "predictions".* FROM "predictions"  WHERE "predictions"."user_id" = $1  [["user_id", 37]]
SELECT "wagers".* FROM "wagers"  WHERE "wagers"."user_id" = $1  [["user_id", 8]]
SELECT "judgments".* FROM "judgments"  WHERE "judgments"."user_id" = $1  [["user_id", 42]]
---
  def show
    @user = User.find_by(id: params[:id])
    @predictions = @user.predictions.limit(5)
    @wagers = @user.wagers.limit(5)
    @judgments = @user.judgments.limit(5)