app/controllers/wagers_controller.rb

  def create
    @prediction = Prediction.find(wager_params[:prediction_id])
    @wager = current_user.wagers.new(wager_params)
    @wager.user_id = current_user.id

    if @wager.save
---
SELECT  "predictions".* FROM "predictions"  WHERE "predictions"."id" = $1 LIMIT 1  [["id", 6]]
INSERT INTO "wagers" ("created_at", "prediction_id", "probability", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-11-26 17:24:18.058934"], ["prediction_id", 3], ["probability", 50], ["updated_at", "2014-11-26 17:24:18.058934"], ["user_id", 37]]